dany994/vak-opensource/trunk/microcontrollers/pic32sim/mx.c
    /*-------------------------------------------------------------------------
     * General purpose IO signals.
     */
    WRITEOP (TRISA); return;	    // Port A: mask of inputs
    WRITEOPX(PORTA, LATA);          // Port A: write outputs
    WRITEOP (LATA);		    // Port A: write outputs
#ifdef UBW32
	/* Control SD card 0 */
	if (VALUE(LATA) & MASKA_CS0)
	    sdcard_select (0, 0);
	else
	    sdcard_select (0, 1);

	/* Control SD card 1 */
	if (VALUE(LATA) & MASKA_CS1)
	    sdcard_select (1, 0);
	else
	    sdcard_select (1, 1);
#endif
	return;
    WRITEOP (ODCA); return;	    // Port A: open drain configuration
    WRITEOP (TRISB); return;	    // Port B: mask of inputs
    WRITEOPX(PORTB, LATB);          // Port B: write outputs
    WRITEOP (LATB);		    // Port B: write outputs
#ifdef EXPLORER16
	/* Control SD card 0 */
	if (d->lat_b & MASKB_CS0)
	    sdcard_select (0, 0);
	else
	    sdcard_select (0, 1);

	/* Control SD card 1 */
	if (d->lat_b & MASKB_CS1)
	    sdcard_select (1, 0);
	else
	    sdcard_select (1, 1);
#endif
	return;
    WRITEOP (ODCB); return;	    // Port B: open drain configuration
    WRITEOP (TRISC); return;	    // Port C: mask of inputs
    WRITEOPX(PORTC, LATC);          // Port C: write outputs
    WRITEOP (LATC);		    // Port C: write outputs
#ifdef UBW32
	if (d->lat_c & MASKC_LDADDR)  /* Swap disk: LDADDR */
	    swap_ldaddr (0);
	else
	    swap_ldaddr (1);
#endif
	return;
    WRITEOP (ODCC); return;	    // Port C: open drain configuration
    WRITEOP (TRISD); return;	    // Port D: mask of inputs
    WRITEOPX(PORTD, LATD);          // Port D: write outputs
    WRITEOP (LATD);		    // Port D: write outputs
#ifdef MAX32
	/* Control SD card 0 */
	if (d->lat_d & MASKD_CS0)
	    sdcard_select (0, 0);
	else
	    sdcard_select (0, 1);

	/* Control SD card 1 */
	if (d->lat_d & MASKD_CS1)
	    sdcard_select (1, 0);
	else
	    sdcard_select (1, 1);
#endif
	return;
    WRITEOP (ODCD); return;	    // Port D: open drain configuration
    WRITEOP (TRISE); return;	    // Port E: mask of inputs
    WRITEOPX(PORTE, LATE);          // Port E: write outputs
    WRITEOP (LATE);		    // Port E: write outputs
#ifdef MAXIMITE
	/* Control SD card 0 */
	if (d->lat_e & MASKE_CS0)
	    sdcard_select (0, 0);
	else
	    sdcard_select (0, 1);
#if 0
	/* Control SD card 1 */
	if (d->lat_e & MASKE_CS1)
	    sdcard_select (1, 0);
	else
	    sdcard_select (1, 1);
#endif
#endif
#ifdef UBW32
	if (d->lat_e & MASKE_RD)        /* Swap disk: RD */
	    swap_rd (0);
	else
	    swap_rd (1);

	if (d->lat_e & MASKE_WR)        /* Swap disk: WR */
	    swap_wr (0);
	else
	    swap_wr (1);

	/* Swap disk: DATA */
	swap_io (d->lat_e >> SHIFTE_DATA,
	    d->tris_e >> SHIFTE_DATA);
#endif
	return;
    WRITEOP (ODCE); return;	    // Port E: open drain configuration
    WRITEOP (TRISF); return;	    // Port F: mask of inputs
    WRITEOPX(PORTF, LATF);          // Port F: write outputs
    WRITEOP (LATF);		    // Port F: write outputs
	return;
    WRITEOP (ODCF); return;	    // Port F: open drain configuration
    WRITEOP (TRISG); return;	    // Port G: mask of inputs
    WRITEOPX(PORTG, LATG);          // Port G: write outputs
    WRITEOP (LATG);		    // Port G: write outputs
	return;
    WRITEOP (ODCG); return;	    // Port G: open drain configuration
    WRITEOP (CNCON); return;	    // Interrupt-on-change control
    WRITEOP (CNEN); return;	    // Input change interrupt enable
    WRITEOP (CNPUE); return;	    // Input pin pull-up enable

    /*-------------------------------------------------------------------------
     * UART 1.
     */
    STORAGE (U1TXREG);                              // Transmit
        vtty_put_char (0, data);
        if ((VALUE(U1MODE) & PIC32_UMODE_ON) &&
            (VALUE(U1STA) & PIC32_USTA_UTXEN) && ! uart_oactive[0]) {
            uart_oactive[0] = 1;
            set_irq (uart_irq[0] + UART_IRQ_TX);
        }
        break;
    WRITEOP (U1MODE);                               // Mode
        if (! (VALUE(U1MODE) & PIC32_UMODE_ON)) {
            clear_irq (uart_irq[0] + UART_IRQ_RX);
            clear_irq (uart_irq[0] + UART_IRQ_TX);
            VALUE(U1STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                               PIC32_USTA_PERR | PIC32_USTA_UTXBF);
            VALUE(U1STA) |= PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
        }
        return;
    WRITEOPR (U1STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        if (! (VALUE(U1STA) & PIC32_USTA_URXEN)) {
            clear_irq (uart_irq[0] + UART_IRQ_RX);
            VALUE(U1STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                PIC32_USTA_PERR);
        }
        if (! (VALUE(U1STA) & PIC32_USTA_UTXEN)) {
            clear_irq (uart_irq[0] + UART_IRQ_TX);
            VALUE(U1STA) &= ~PIC32_USTA_UTXBF;
            VALUE(U1STA) |= PIC32_USTA_TRMT;
        }
        return;
    WRITEOP (U1BRG); return;                        // Baud rate
    READONLY (U1RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 2.
     */
    STORAGE (U2TXREG);                              // Transmit
        vtty_put_char (1, data);
        if ((VALUE(U2MODE) & PIC32_UMODE_ON) &&
            (VALUE(U2STA) & PIC32_USTA_UTXEN) && ! uart_oactive[1]) {
            uart_oactive[1] = 1;
            set_irq (uart_irq[1] + UART_IRQ_TX);
        }
        break;
    WRITEOP (U2MODE);                               // Mode
        if (! (VALUE(U2MODE) & PIC32_UMODE_ON)) {
            clear_irq (uart_irq[1] + UART_IRQ_RX);
            clear_irq (uart_irq[1] + UART_IRQ_TX);
            VALUE(U2STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                               PIC32_USTA_PERR | PIC32_USTA_UTXBF);
            VALUE(U2STA) |= PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
        }
        return;
    WRITEOPR (U2STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        if (! (VALUE(U2STA) & PIC32_USTA_URXEN)) {
            clear_irq (uart_irq[1] + UART_IRQ_RX);
            VALUE(U2STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                PIC32_USTA_PERR);
        }
        if (! (VALUE(U2STA) & PIC32_USTA_UTXEN)) {
            clear_irq (uart_irq[1] + UART_IRQ_TX);
            VALUE(U2STA) &= ~PIC32_USTA_UTXBF;
            VALUE(U2STA) |= PIC32_USTA_TRMT;
        }
        return;
    WRITEOP (U2BRG); return;                        // Baud rate
    READONLY (U2RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 3.
     */
    STORAGE (U3TXREG);                              // Transmit
        vtty_put_char (2, data);
        if ((VALUE(U3MODE) & PIC32_UMODE_ON) &&
            (VALUE(U3STA) & PIC32_USTA_UTXEN) && ! uart_oactive[2]) {
            uart_oactive[2] = 1;
            set_irq (uart_irq[2] + UART_IRQ_TX);
        }
        break;
    WRITEOP (U3MODE);                               // Mode
        if (! (VALUE(U3MODE) & PIC32_UMODE_ON)) {
            clear_irq (uart_irq[2] + UART_IRQ_RX);
            clear_irq (uart_irq[2] + UART_IRQ_TX);
            VALUE(U3STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                               PIC32_USTA_PERR | PIC32_USTA_UTXBF);
            VALUE(U3STA) |= PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
        }
        return;
    WRITEOPR (U3STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        if (! (VALUE(U3STA) & PIC32_USTA_URXEN)) {
            clear_irq (uart_irq[2] + UART_IRQ_RX);
            VALUE(U3STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                PIC32_USTA_PERR);
        }
        if (! (VALUE(U3STA) & PIC32_USTA_UTXEN)) {
            clear_irq (uart_irq[2] + UART_IRQ_TX);
            VALUE(U3STA) &= ~PIC32_USTA_UTXBF;
            VALUE(U3STA) |= PIC32_USTA_TRMT;
        }
        return;
    WRITEOP (U3BRG); return;                        // Baud rate
    READONLY (U3RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 4.
     */
    STORAGE (U4TXREG);                              // Transmit
        vtty_put_char (3, data);
        if ((VALUE(U4MODE) & PIC32_UMODE_ON) &&
            (VALUE(U4STA) & PIC32_USTA_UTXEN) && ! uart_oactive[3]) {
            uart_oactive[3] = 1;
            set_irq (uart_irq[3] + UART_IRQ_TX);
        }
        break;
    WRITEOP (U4MODE);                               // Mode
        if (! (VALUE(U4MODE) & PIC32_UMODE_ON)) {
            clear_irq (uart_irq[3] + UART_IRQ_RX);
            clear_irq (uart_irq[3] + UART_IRQ_TX);
            VALUE(U4STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                               PIC32_USTA_PERR | PIC32_USTA_UTXBF);
            VALUE(U4STA) |= PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
        }
        return;
    WRITEOPR (U4STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        if (! (VALUE(U4STA) & PIC32_USTA_URXEN)) {
            clear_irq (uart_irq[3] + UART_IRQ_RX);
            VALUE(U4STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                PIC32_USTA_PERR);
        }
        if (! (VALUE(U4STA) & PIC32_USTA_UTXEN)) {
            clear_irq (uart_irq[3] + UART_IRQ_TX);
            VALUE(U4STA) &= ~PIC32_USTA_UTXBF;
            VALUE(U4STA) |= PIC32_USTA_TRMT;
        }
        return;
    WRITEOP (U4BRG); return;                        // Baud rate
    READONLY (U4RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 5.
     */
    STORAGE (U5TXREG);                              // Transmit
        vtty_put_char (4, data);
        if ((VALUE(U5MODE) & PIC32_UMODE_ON) &&
            (VALUE(U5STA) & PIC32_USTA_UTXEN) && ! uart_oactive[4]) {
            uart_oactive[4] = 1;
            set_irq (uart_irq[4] + UART_IRQ_TX);
        }
        break;
    WRITEOP (U5MODE);                               // Mode
        if (! (VALUE(U5MODE) & PIC32_UMODE_ON)) {
            clear_irq (uart_irq[4] + UART_IRQ_RX);
            clear_irq (uart_irq[4] + UART_IRQ_TX);
            VALUE(U5STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                               PIC32_USTA_PERR | PIC32_USTA_UTXBF);
            VALUE(U5STA) |= PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
        }
        return;
    WRITEOPR (U5STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        if (! (VALUE(U5STA) & PIC32_USTA_URXEN)) {
            clear_irq (uart_irq[4] + UART_IRQ_RX);
            VALUE(U5STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                PIC32_USTA_PERR);
        }
        if (! (VALUE(U5STA) & PIC32_USTA_UTXEN)) {
            clear_irq (uart_irq[4] + UART_IRQ_TX);
            VALUE(U5STA) &= ~PIC32_USTA_UTXBF;
            VALUE(U5STA) |= PIC32_USTA_TRMT;
        }
        return;
    WRITEOP (U5BRG); return;                        // Baud rate
    READONLY (U5RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 6.
     */
    STORAGE (U6TXREG);                              // Transmit
        vtty_put_char (5, data);
        if ((VALUE(U6MODE) & PIC32_UMODE_ON) &&
            (VALUE(U6STA) & PIC32_USTA_UTXEN) && ! uart_oactive[5]) {
            uart_oactive[5] = 1;
            set_irq (uart_irq[5] + UART_IRQ_TX);
        }
        break;
    WRITEOP (U6MODE);                               // Mode
        if (! (VALUE(U6MODE) & PIC32_UMODE_ON)) {
            clear_irq (uart_irq[5] + UART_IRQ_RX);
            clear_irq (uart_irq[5] + UART_IRQ_TX);
            VALUE(U6STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                               PIC32_USTA_PERR | PIC32_USTA_UTXBF);
            VALUE(U6STA) |= PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
        }
        return;
    WRITEOPR (U6STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        if (! (VALUE(U6STA) & PIC32_USTA_URXEN)) {
            clear_irq (uart_irq[5] + UART_IRQ_RX);
            VALUE(U6STA) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                PIC32_USTA_PERR);
        }
        if (! (VALUE(U6STA) & PIC32_USTA_UTXEN)) {
            clear_irq (uart_irq[5] + UART_IRQ_TX);
            VALUE(U6STA) &= ~PIC32_USTA_UTXBF;
            VALUE(U6STA) |= PIC32_USTA_TRMT;
        }
        return;
    WRITEOP (U6BRG); return;                        // Baud rate
    READONLY (U6RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * SPI.
     */
    WRITEOP (SPI1CON);                              // Control
        if (! (VALUE(SPI1CON) & PIC32_SPICON_ON)) {
            clear_irq (spi_irq[0] + SPI_IRQ_FAULT);
            clear_irq (spi_irq[0] + SPI_IRQ_RX);
            clear_irq (spi_irq[0] + SPI_IRQ_TX);
            VALUE(SPI1STAT) = PIC32_SPISTAT_SPITBE;
        } else if (! (VALUE(SPI1CON) & PIC32_SPICON_ENHBUF)) {
            spi_rfifo[0] = 0;
            spi_wfifo[0] = 0;
        }
        return;
    WRITEOPR (SPI1STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI1BUF);                              // Buffer
        spi_writebuf (0, data);
        return;
    WRITEOP (SPI1BRG); return;                      // Baud rate
    WRITEOP (SPI2CON);                              // Control
        if (! (VALUE(SPI2CON) & PIC32_SPICON_ON)) {
            clear_irq (spi_irq[1] + SPI_IRQ_FAULT);
            clear_irq (spi_irq[1] + SPI_IRQ_RX);
            clear_irq (spi_irq[1] + SPI_IRQ_TX);
            VALUE(SPI2STAT) = PIC32_SPISTAT_SPITBE;
        } else if (! (VALUE(SPI2CON) & PIC32_SPICON_ENHBUF)) {
            spi_rfifo[1] = 0;
            spi_wfifo[1] = 0;
        }
        return;
    WRITEOPR (SPI2STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI2BUF);                              // Buffer
        spi_writebuf (1, data);
        return;
    WRITEOP (SPI2BRG); return;                      // Baud rate
    WRITEOP (SPI3CON);                              // Control
        if (! (VALUE(SPI3CON) & PIC32_SPICON_ON)) {
            clear_irq (spi_irq[2] + SPI_IRQ_FAULT);
            clear_irq (spi_irq[2] + SPI_IRQ_RX);
            clear_irq (spi_irq[2] + SPI_IRQ_TX);
            VALUE(SPI3STAT) = PIC32_SPISTAT_SPITBE;
        } else if (! (VALUE(SPI3CON) & PIC32_SPICON_ENHBUF)) {
            spi_rfifo[2] = 0;
            spi_wfifo[2] = 0;
        }
        return;
    WRITEOPR (SPI3STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI3BUF);                              // Buffer
        spi_writebuf (2, data);
        return;
    WRITEOP (SPI3BRG); return;                      // Baud rate
    WRITEOP (SPI4CON);                              // Control
        if (! (VALUE(SPI4CON) & PIC32_SPICON_ON)) {
            clear_irq (spi_irq[3] + SPI_IRQ_FAULT);
            clear_irq (spi_irq[3] + SPI_IRQ_RX);
            clear_irq (spi_irq[3] + SPI_IRQ_TX);
            VALUE(SPI4STAT) = PIC32_SPISTAT_SPITBE;
        } else if (! (VALUE(SPI4CON) & PIC32_SPICON_ENHBUF)) {
            spi_rfifo[3] = 0;
            spi_wfifo[3] = 0;
        }
        return;
    WRITEOPR (SPI4STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI4BUF);                              // Buffer
        spi_writebuf (3, data);
        return;
    WRITEOP (SPI4BRG); return;      // Baud rate

    default:
        fprintf (stderr, "--- Write %08x to %08x: peripheral register not supported\n",
            data, address);
        exit (1);
readonly:
        fprintf (stderr, "--- Write %08x to %s: readonly register\n",
            data, *namep);
        *namep = 0;
        return;
    }
    *bufp = data;
}

void io_reset()
{
    /*
     * Bus matrix control registers.
     */
    VALUE(BMXCON)    = 0x001f0041;      // Bus Matrix Control
    VALUE(BMXDKPBA)  = 0;               // Data RAM kernel program base address
    VALUE(BMXDUDBA)  = 0;               // Data RAM user data base address
    VALUE(BMXDUPBA)  = 0;               // Data RAM user program base address
    VALUE(BMXPUPBA)  = 0;               // Program Flash user program base address
    VALUE(BMXDRMSZ)  = 128 * 1024;      // Data RAM memory size
    VALUE(BMXPFMSZ)  = 512 * 1024;      // Program Flash memory size
    VALUE(BMXBOOTSZ) = 12 * 1024;       // Boot Flash size

